from flask import Flask, render_template, request, redirect, url_for

app = Flask(__name__)

insights_data = {}  # Store insights data temporarily

@app.route('/')
def index():
    return render_template('index.html')

@app.route('/submit', methods=['POST'])
def submit():
    # Get form data
    regular_care = request.form.get('regular_care')
    smoking = request.form.get('smoking')
    chronic_diseases = request.form.getlist('chronic_diseases')
    weekly_bowel_movements = request.form.get('weekly_bowel_movements')
    problems = request.form.get('problems')
    urination_frequency = request.form.get('urination_frequency')
    exercise = request.form.get('exercise')
    health_issues = request.form.getlist('health_issues')

    # Perform analysis
    insights = ""

    if regular_care == 'no':
        insights += "متابعة الحمل بشكل منتظم تمكن من التشخيص المبكر لمشاكل صحية من شأنها أن تنشأ خلال فترة الحمل وعلاجها، وبهذا تزيد من احتمال الحمل السليم وإنجاب مولود معافى.\n<br><hr>"

    if smoking == 'yes':
        insights += "خطة الاقلاع:\n• القيام بعمل قائمة لفوائد الإقلاع عن التدخين\n بعض الفوائد للجنين:\n1. يقلل خطر أن يولد ناقص الوزن أو مبكرًا.\n2. يزيد عدد العناصر الغذائية والأكسجين التي سيحصل عليها.\n3. يقلل خطر تعرضه لمشاكل صحية.\n4. يزيد فرص خروجه معك إلى المنزل بعد الولادة.\nبعض الفوائد للأم:\n1. يقلل مخاطر المشاكل الصحية المستقبلية (مثل: أمراض القلب، والسرطان، ومشاكل الرئة).\n2. توفير المال لإنفاقه على مستلزمات الأطفال.\n• تغيير العادات اليومية\n1. التدخين بعد الوجبة، يُستبدل بالمشي أو قراءة كتاب الحمل المفضل.\n2. التدخين عند القراءة، يُستبدل في شرب اللبن، أو تناول وجبة خفيفة صغيرة.\n• الدعم القوي:\nقد يساعد وجود صديق أو أحد أفراد الأسرة على إحداث تغيير. كما أنه من المفيد أيضًا أن تكون بالقرب من أشخاص آخرين لا يدخنون.\n• اسأل مقدم الرعاية الصحية:\nسيساعد مقدم الرعاية الصحية في العثور على برنامج الإقلاع أو مساعدات الإقلاع.\n• تحديد موعد الإقلاع عن التدخين:\nهذا هو اليوم الذي يتم رمي فيه جميع السجائر.\n\nنصائح للإقلاع عن التدخين:\n1. إبقاء اليدين والفم مشغولين (مثل: مضغ العلكة).\n2. عند الشعور بالرغبة في التدخين، يجب إلقاء نظرة على القائمة التي تم تسجيلها لأسباب الإقلاع عن التدخين.\n3. الاتصال بشخص داعم عندما الشعور بالرغبة في التدخين.\n4. تجنب الجلوس في أماكن التدخين، أو مع أشخاص مدخنين.\n\n<br><hr>"

    if 'asthma' in chronic_diseases:
        insights+= "كيفية إدارة الربو أثناء الحمل من المهم الحفاظ على السيطرة الجيدة على الربو أثناء الحمل. سيساعد ذلك في تقليل خطر حدوث مضاعفات للأم والجنين. يجب على النساء المصابات بالربو العمل بشكل وثيق مع طبيبهن لوضع خطة علاج شخصية. تتضمن خطة العلاج عادةً ما يلي: الاستمرار في تناول الأدوية الموصوفة لعلاج الربو مراقبة الأعراض بعناية تجنب مسببات الربو اتخاذ خطوات لمنع التفاقم<br><hr>"

    if problems == 'constipation':
      insights += "للأمور التالية تأثير إيجابي على علاج الامساك الحامل: تناول وجبات غنية بالألياف: من الناحية المثالية، سوف تستهلك ما بين 25 إلى 30 غراماً يومياً من الألياف الغذائية من الفواكه والخضروات وحبوب الإفطار وخبز الحبوب الكاملة. شرب الكثير من السوائل: إن شرب الكثير من السوائل أمر مهم، خاصة عند زيادة تناول الألياف وحبوب المكملات الغذائية التي تحتوي علي الحديد. فقد يساعد شرب 10 إلى 12 كوب من السوائل كل يوم على علاج الامساك عند الحامل. ممارسة الرياضة بشكل روتيني: إذا كنت غير نشط فلديك فرصة أكبر للإمساك. لكن المشي والسباحة وغيرها من التمارين المعتدلة تساعد الأمعاء على العمل عن طريق تحفيز حركة الأمعاء، فأداء التمارين ثلاث مرات في الأسبوع لمدة 20-30 دقيقة أمر مهم لعلاج الامساك عند الحامل. استخدام الأدوية المتاحة بدون وصفة طبية أو ملين للامساك للحامل: هناك منتجات لا تحتاج إلى وصفة طبية، والتي قد تساعد في تسريع حركات الأمعاء وتقليل الإمساك، ولكن ينصح بعدم استخدامها بصورة متكررة، واستشارة الطبيب أو الصيدلي قبل تناول ملين للحامل. تقليل تناول مكملات الحديد والكالسيوم قد يسهم في الحد من الإمساك. ويمكن للتغذية الجيدة أن تلبي احتياجات الحديد والكالسيوم في أغلب الأحيان أثناء الحمل. ينبغي تجنب استخدام الزيوت المعدنية عند وجود امساك للحامل لأنها تقلل من امتصاص المغذيات، وينبغي التحدث دائماً إلى مقدم الرعاية الصحية قبل استخدام الأدوية التي لا تستلزم وصفة طبية، واستشارته عند الرغبة في علاج الامساك المزمن للحامل.<br><hr>"

    if problems == 'diarrhea':
        insights=+"طرق لعلاج الإسهال أثناء الحمل 1- شرب السوائل يتعين على الحامل الاهتمام بشرب كمية وفيرة من الماء والعصائر الطبيعية والشوربة عند الإصابة بالإسهال، لتعويض السوائل والمعادن والأملاح والفيتامينات التي فقدها الجسم، ومن ثم الوقاية من الجفاف. 2- تناول الأطعمة الخفيفة تناول الطعام ليس ممنوعًا للحامل عند الإصابة بالإسهال، ولكن يشترط أن يكون خفيفًا على الجهاز الهضمي، لضمان تنظيم حركة الأمعاء، دون تفاقم الأعراض. وتشمل الأطعمة المناسبة للحامل في حالة الإصابة بالإسهال: - الموز، الأرز ، التفاح، الخبز المحمص 3- تناول الأطعمة الغنية بالبروبيوتيك من الضروري أن تتناول الحامل الأطعمة الغنية بمادة البروبيوتيك، مثل الزبادي، إذا كان الإسهال ناتجًا عن المضادات الحيوية، لأنها تساهم في إعادة التوازن البكتيري بالأمعاء. 4- تجنب بعض الأطعمة هناط أطعمة لا بد أن تبتعد عنها الحامل عند الإصابة بالإسهال، لأنها تزيد من حدته، مثل المقليات والمأكولات الحارة ومنتجات الألبان كاملة الدسم متى يستدعي الإسهال عند الحامل زيارة الطبيب؟ من الضروري أن تقوم الحامل بزيارة الطبيب، إذا كان الإسهال لديها ناتجًا عن بعض الأدوية، ليصف لها بدائل أكثر أمانًا على الجهاز الهضمي.<br><hr>"


    if exercise == 'yes':
        pass  # No insights for this option

    elif exercise == 'no':
        insights += "تساعدك ممارسة الرياضة أثناء الحمل على التأقلم مع متطلباتك البدنية والعقلية، كما تهيئ جسدك للولادة. تساهم في تفادي أعراض الحمل المزعجة التي قد تتعرضين لها كآلآم الظهر مثلًا. تجنبك مشاكل صحية، مثل: تسمم الحمل. تساهم في التحسين من صحتك العامة وتساعدك على النوم بشكل أفضل.​ <br><hr>  "


    if 'weight_loss' in health_issues:
        insights += "يمكن أن يتسبب فقدان الوزن خلال فترة الحمل في بعض المخاطر الصحية سواء على الأم أو الجنين من بينها: - انخفاض وزن الجنين. - انخفاض مستويات الحديد في الدم ومن ثم الإصابة بفقر الدم. - قلة مستويات الكالسيوم في الدم، مما قد يؤدي إلى مشاكل في العظام. - صعوبة الولادة. - في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً\n<br><hr>"
    
    if 'continuous_nausea_vomiting' in health_issues:
        insights += "من المضاعفات التي قد يسببها القيء الحملي المستمر ما يلي: الجفاف الشديد. فقدان الأملاح المهمة في الجسم، مثل الصوديوم والبوتاسيوم. فقدان الوزن، والإصابة بسوء التغذية تمزق المريء. الإصابة بالاكتئاب، والتوتر والقلق. الولادة قبل موعدها. تسمم الحمل. ولادة طفل وزنه قليل.--في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً.\n<br><hr>"

    if 'gestational_diabetes' in health_issues:
        insights += "اكتشاف السكري الحملي مبكراً يساعد في السيطرة على مستويات السكر في الدم وتجنب المضاعفات.--في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً\n<br><hr>"

    if 'high_blood_pressure' in health_issues:
        insights += "ارتفاع ضغط الدم خلال الحمل يمكن أن يكون علامة على مضاعفات خطيرة، ويحتاج إلى متابعة طبية دقيقة.--في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً\n<br><hr>"

    if 'preeclampsia' in health_issues:
        insights += "تسمم الحمل يعتبر حالة طبية خطيرة ويجب مراقبتها بعناية من قبل الطبيب.--في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً\n<br><hr>"

    if 'bleeding' in health_issues:
        insights += "يرتبط النزيف المهبلي في الأسابيع 12 الأولى من الحمل بخطر الاجهاض أو الحمل خارج الرحم.--في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً\n<br><hr>"

    if 'severe_abdominal_pain' in health_issues:
        insights += "في بعض الأحيان يمكن أن يشير ألم أسفل البطن للحامل المترافق بأعراض اخرى إلى حالة تحتاج للتقييم الطبي والعلاج، ومن هذه الحالات ما يلي: التهاب المسالك البولية الحمل خارج الرحم. الإجهاض ويسبب ألم أسفل البطن للحامل والنزيف وألم أسفل الظهر. انفصال المشيمة.--في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً.\n<br><hr>"

    if 'burning_during_urination' in health_issues:
        insights += "حرقة أثناء التبول قد تشير إلى عدوى بولية ويحتاج إلى تقييم طبي.--في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً\n<br><hr>"

    if 'fever' in health_issues:
        insights += "ارتفاع في درجة الحرارة قد يكون علامة على عدوى أو مشكلة صحية أخرى ويحتاج إلى تقييم من الطبيب.--في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً\n<br><hr>"

    if 'severe_persistent_headache' in health_issues:
        insights += "صداع شديد ومستمر يمكن أن يكون علامة على مشاكل صحية خطيرة ويحتاج إلى تقييم طبي.--في حال كنتِ تعانين من هذا العرض يرجى مراجعة الطبيب فوراً\n<br><hr>"

    insights_data['insights'] = insights

    return redirect(url_for('view_insights'))

@app.route('/view_insights')
def view_insights():
    insights = insights_data.get('insights', 'No insights available')
    return render_template('insights.html', insights=insights)

@app.route('/forbidden_medications')
def forbidden_medications():
    # Fetch forbidden medications data or render a template
    forbidden_meds = ["Medication 1", "Medication 2", "Medication 3"]  # Example data
    return render_template('medications.html', forbidden_meds=forbidden_meds)


if __name__ == '__main__':
    app.run(debug=True)
